import * as yup from 'yup';

const validationSchema = yup.object().shape({
	transactionTitle: yup
		.string()
		.required('Ввод баланса обязателен!')
		.min(1, 'Минимальное коликство символов 1')
		.max(16, 'Максимальное коликство символов 13'),
	brokerage: yup
		.string()
		.required('Ввод брокера обязателен!')
		.min(1, 'Минимальное коликство символов 1')
		.max(16, 'Максимальное коликство символов 13'),
	assets: yup
		.string()
		.required('Ввод ценой бумаги обязателен!')
		.min(1, 'Минимальное коликство символов 1')
		.max(16, 'Максимальное коликство символов 13'),
	stocksValue: yup
		.string()
		.required('Ввод баланса обязателен!')
		.min(1, 'Минимальное коликство символов 1')
		.max(16, 'Максимальное коликство символов 13')
		.matches(/^[0-9]*$/, 'Введите только цифры!'),
	taxRate: yup
		.string()
		.required('Ввод баланса обязателен!')
		.min(1, 'Минимальное коликство символов 1')
		.max(16, 'Максимальное коликство символов 13')
		.matches(/^[0-9]*$/, 'Введите только цифры!'),
});

export default validationSchema;
